<?php


// Задача 4. Напишете вложени for цикли, които извеждат следното:
//    *
//    * *
//    * * *
//    * * * *
//    * * * * *


for ($i = 1; $i <= 5; $i++) { // първият for цикъл определя редовете 
    echo '*'; // извежда всяка първа * от всеки ред;
      for ($j = 1; $j < $i; $j++) {  // докато j < i - извеждай на екрана *
//    $i = 1 и $j = 1 -> 1 не е по-малко от 1 - не извежда * на екрана, а само '<br/>- нов ред и следва следваща итерация - външен цикъл
//    $i = 2 и $j = 1 -> 1 е по-малко от 2 - извежда * и увеличава j с 1 , следва итерация, но във вътрешния цикъл
//    $i = 2 и $j = 2 -> 2 не е по-малко от 2 - излиза от цикъла, слага нов ред, увеличава i с 1, следваща итерация
//    $i = 3 и $j = 1 -> 1 е по-малко от 3 - извежда втора *(първата се извежда всеки път преди да влезе във втория for), увеличава j с 1        
//    $i = 3 и $j = 2 -> 2 е по-малко от 3 - извежда *, увеличава j с 1
//    $i = 3 и $j = 3 -> 3 не е по-малко от 3 - излиза от цикъла, слага нов ред и увеличава i с 1
//    ...          
          echo '*';           //извеждане на * от втория цикъл
    }                        // край на вложен цикъл
    echo '<br/>';           // нов ред
}                          // край на външен цикъл

