<?php

//Задача 2. Напишете php програмка, която извежда сумата на числата от 0 до 30.
// Използвайте for цикъл.


$sum = 0;                                 //създавам променлива от тип int, равна на 0 - 
                                         //в нея ще записвам сумата на числата от 0 до 30
for($i=0; $i <=30; $i++){               // по условие имам: извеждане на сума от 0 до 30,
                                       //следователно - for цикълът започва от 0 и ще върти до 30 вкл.
    
      $sum += $i;                    //в sum ще записвам текущата стойност на sum и ще прибавям i,
   // $sum = $sum + $i;             // а i,след всяка итерация на цикъла - ще се увеличава и така ще достигна до 
  //0 = 0 + 0  итерация 1          // числото по условие - 30, и до търсената сума 
 //0 = 0 + 1   итерация 2         
//1 = 1 + 2    итерация 3 и т.н                    
                                                            
}                               // край на цикъла, след като i e > 30

echo 'Сумата на числата от 0 до 30 е:  ' . $sum;   //извеждам на екрана 'Сумата от числата от 0 до 30 е : '
                                                  // и получената сума , след приключване на for цикъка
