<?php
////Задача 5 Напишете вложени for цикли, които извеждат следното:
//    *
//    * *
//    * * *
//    * * * *
//    * * * * *
//    * * * * *
//    * * * *
//    * * *
//    * *
//    *


for ($i = 1; $i <= 5; $i++) {           //Кодът от задача 4.
    echo '*';                          //Нарастващ ред
     for ($j = 1; $j < $i; $j++) {
        echo '*';
    }
    echo '<br/>';
}
for ($i = 5; $i > 0; $i--) {         //Намаляващ ред - затова обръщам този for цикъл
    

    for ($j = $i; $j > 0; $j--) {   //i = 5,j = 5 
        echo '*';                  // Извеждай *, докато j > 0 , т.е 5*. 
                                  // На следваща итерация: i = 4, j = 4 -> 4* и така докато i = 1
    }
    echo '<br/>';
}




