<?php

//Задача 3. Напишете php програмка, която извежда факториела на  5, 8 и 10.
// Факториел на число е произведението на всички цели числа от 1 до него,
// включително. Пример: факториел 5 е равен на 1 * 2 * 3 * 4 * 5.) 5= 1*2*3*4*5

$fact5 = 1;                                // създавам си променлива, 
                                         // в която ще записвам умножението с 
                                        // всяко следващо число
for($i = 1; $i<=5; $i++){              // при фактоерл от 5 - ще имам 5 итерации - 
                                        
    $fact5 *= $i;                     // подобно при зад. 2 , но тук имаме умножение
  //$fact = $fact * $i           
    
}

echo 'Факториел от 5 е: ' . $fact5;  //извеждаме на екрана Факториел от 5 
//echo 'Факториел от 5 -> 5!=(1*2*3*4*5)= ' . $fact5; 

//**************************************************************************

echo '<br/>';

//Факториел 8 
$fact8 = 1;

for ($i = 1; $i <= 8; $i++) {
    $fact8 *= $i;
}

echo 'Факториел от 8 е: ' . $fact8;

//*************************************************************************

echo '<br/>';

//Факториел 8 
$fact10 = 1;

for ($i = 1; $i <= 10; $i++) {
    $fact10 *= $i;
}

echo 'Факториел от 10 е: ' . $fact10;

