<?php

//Задача 1. Напишете for цикъл, 
//който извежда числа от 1 до 10, 
//разделени с тире, като преди 1 и след 10
// не трябва да има тире: 1-2-3-4-5-6-7-8-9-10


for ($i = 1; $i <= 10; $i++) {          // цикълът започва от 1, като ще се върти 10 пъти вкл.
    echo $i;                           // извежда се на екрана стойността на i
    if ($i < 10) {                    // правим проверка: ако i е по-малко от 10:
        echo '-';                    // изведи на екрана '-'
    }                               // излиза от if, когато i = 10
}                                  // for цикълът приключва, 
                                  //след като на екрана са изведени всички числа от 1 до 10вкл., 
                                 //разделени със знакът - 
